# ElectricalLoadAreaData Properties

---
The ElectricalLoadAreaData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from SpatialElementDomainData)
Top
#### Reference
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace